perf-test.yml
---
execution:
- concurrency: 100
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple
                  
scenarios:
  simple:
    think-time: 0.001
    requests:
    - url: http://localhost:8000/
      method: GET
    - url: http://localhost:8000/post
      method: POST
      body: "the_body"

settings:
  default-executor: gatling